In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4, 7, 5, -3])

In [4]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [5]:
obj.values

array([ 4,  7,  5, -3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['b','d','a','c'])

In [8]:
obj2

b    4
d    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['b', 'd', 'a', 'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2['d'] = 6

In [14]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2[obj2 > 0]

b    4
d    6
c    3
dtype: int64

In [16]:
obj2*2

b     8
d    12
a   -10
c     6
dtype: int64

In [17]:
import NumPy as np

ModuleNotFoundError: No module named 'NumPy'

In [18]:
import numpy as np

In [19]:
np.exp(obj2)

b     54.598150
d    403.428793
a      0.006738
c     20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

In [22]:
sdata = {'Ohio':35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
obj3 = pd.Series(sdata)

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [26]:
obj4 = pd.Series(sdata, index=states)

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [34]:
obj4.name = 'population'

In [35]:
obj4.index.name = 'state'

In [36]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [37]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [38]:
obj.index =['Bob','Steve','Jeff','Ryan']

In [39]:
obj

Bob      4
Steve    7
Jeff     5
Ryan    -3
dtype: int64

In [41]:
data ={'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada','Nevada','Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7,3.6, 2.4, 2.9, 3.2]}

In [42]:
frame = pd.DataFrame(data)

In [43]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [44]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [45]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [46]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three','four',
                              'five', 'six'])

In [47]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [48]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [49]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [50]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [51]:
frame2['debt']=16.5

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [54]:
frame2['debt']=np.arange(6.)

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [57]:
val = pd.Series([-1.2, -1.5,-1.7], index=['two','four','five'])

In [58]:
frame2['debt'] = val

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [61]:
frame2['eastern']=frame2.state == 'Ohio'

In [63]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

del frame2['eastern']

In [64]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [65]:
del frame2['eastern']

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [67]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [69]:
frame3 = pd.DataFrame(pop)

In [70]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [71]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [73]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [74]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [75]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [76]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [77]:
frame3.index.name = 'year'; frame3.columns.name='state'

In [78]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [79]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [80]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [81]:
obj = pd.Series(range(3), index=['a','b','c'])

In [82]:
index = obj.index

In [83]:
index

Index(['a', 'b', 'c'], dtype='object')

In [84]:
index[1:]

Index(['b', 'c'], dtype='object')

In [85]:
index[1]='d'

TypeError: Index does not support mutable operations

In [86]:
labels = pd.Index(np.arange(3))

In [87]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [88]:
obj2 = pd.Series([1.5,-2.5,0], index=labels)

In [89]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [90]:
obj2.index is labels

True

In [91]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [92]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [93]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [94]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [95]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])

In [96]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [97]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [98]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [99]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [100]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [102]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [104]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a','c','d'],
                     columns = ['Ohio', 'Texas', 'California'])

frame

In [105]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

frame2 = frame.reindex(['a','b','c','d'])

In [106]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [107]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [108]:
frame2 = frame.reindex(['a','b','c','d'])

In [109]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [110]:
states = ['Texas', 'Utah', 'California']

In [111]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [113]:
frame.loc(['a','b','c','d'], states)

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [114]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [123]:
frame.loc[['a','b']]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [124]:
states

['Texas', 'Utah', 'California']

In [125]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [126]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [127]:
frame.loc[['a','b','c','d'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [128]:
df = pd.DataFrame([[1,2],[4,5],[7,8]],
                 index = ['Cobra','Viper','Sidewinder'],
                 columns=['max_speed', 'shield'])

In [129]:
df

            max_speed  shield
Cobra               1       2
Viper               4       5
Sidewinder          7       8

In [130]:
df.loc['Viper']

max_speed    4
shield       5
Name: Viper, dtype: int64

In [131]:
df.loc[['Viper', 'Sidewinder']]

            max_speed  shield
Viper               4       5
Sidewinder          7       8

In [133]:
df.loc['Cobra','shield']

2

In [134]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [135]:
frame.loc[states]

KeyError: "None of [Index(['Texas', 'Utah', 'California'], dtype='object')] are in the [index]"

In [136]:
states

['Texas', 'Utah', 'California']

In [137]:
type(states)

list

In [138]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [143]:
frame.loc[('a','c'), states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [144]:
frames

NameError: name 'frames' is not defined

In [145]:
frames

NameError: name 'frames' is not defined

In [146]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [147]:
states = ['Ohio', 'Texas', 'California']

In [148]:
frame.loc['a', states]

Ohio          0
Texas         1
California    2
Name: a, dtype: int64

In [149]:
frame.loc[['a','c','d'], states]

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [150]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [151]:
states

['Ohio', 'Texas', 'California']

In [152]:
frame2.loc[['a','b','c','d'], states]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [153]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [154]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [155]:
new_obj = obj.drop('c')

In [156]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [157]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [158]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio','Colorado','Utah','New York'],
                    columns=['one', 'two','three','four'])

In [159]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [162]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [163]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

In [164]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [165]:
obj['b']

1.0

In [166]:
obj[1]

1.0

In [167]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [168]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [169]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one','two','three','four'])

In [170]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [171]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [172]:
data[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [173]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [174]:
data[:-1]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [175]:
data[:-2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [176]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [177]:
data[data < 5] = 0

In [178]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [181]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [182]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [183]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [184]:
index

Index(['a', 'b', 'c'], dtype='object')

In [185]:
axis

NameError: name 'axis' is not defined

In [186]:
obj = pd.Series(range(4), index=['d','a','b','c'])

In [187]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [188]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [189]:
obj.sort()

AttributeError: 'Series' object has no attribute 'sort'

In [190]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [194]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),
                  index=['three','one'],
                  columns=['d','a','b','c'])

In [195]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [196]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [197]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [198]:
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [199]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [200]:
frame=pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [201]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [202]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [1]:
import pandas_datareader.data as web

/Users/liwei2/opt/anaconda3/envs/dev/lib/python3.7/site-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [2]:
all_data = {ticker:web.get_data_yahoo(ticker)
           for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [3]:
price = pd.DataFrame({ticker:data['Adj Close']
                     for ticker, data in all_data.items()})

NameError: name 'pd' is not defined

In [ ]:
volume = pd.DataFrame({ticker:data['Volume']
                      for ticker, data in all_data.item()})

In [ ]:
returns = price.pct_change()

In [ ]:
returns.tail()

In [ ]:
returns

In [ ]:
returns.tail()

In [ ]:
all_data

In [7]:
import pandas as pd
data = pd.DataFrame({'Qu1':[1,3,4,3,4],
                    'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [8]:

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [10]:
result = data.apply(pd.value_counts)

result

In [11]:
type(result)

pandas.core.frame.DataFrame

In [12]:
result.head()

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [13]:
result['Qu1']

1    1.0
2    NaN
3    2.0
4    2.0
5    NaN
Name: Qu1, dtype: float64

In [14]:
data['Qu1']

0    1
1    3
2    4
3    3
4    4
Name: Qu1, dtype: int64

In [15]:
a = ['foo','bar','quux', 'corge']

In [16]:
a

['foo', 'bar', 'quux', 'corge']

In [17]:
type(a)

list